<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"ba77492b12b5d290bd60f1ebd5f067ac3ec995409fce84e90b9b1ddacc0d61a6","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #1427 at https://github.com/cal-itp/data-infra/actions/runs/21730591150","plan_out_hash":"5e50538463f251c15e8e2a18a26ab07f77fcdd7b5a247b6c3ff3d0ba78776f48","plan_hash":"e3ab70eb0d2ab21247f6b526118d5c3536cd4af29ffe91ef9442b44a848369b0","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 1 to add, 15 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["dags/README.md"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "rgeUuw==" -> (known after apply)
!~      detect_md5hash      = "GRqdjA49Oc6ZRzXofCvZ5g==" -> "different hash"
!~      generation          = 1770160315682183 -> (known after apply)
        id                  = "calitp-staging-composer-dags/README.md"
!~      md5hash             = "GRqdjA49Oc6ZRzXofCvZ5g==" -> (known after apply)
        name                = "dags/README.md"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["dags/download_parse_and_validate_gtfs.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "57EeAg==" -> (known after apply)
!~      detect_md5hash      = "kwmnFy/FxUr7dnmDCPosRA==" -> "different hash"
!~      generation          = 1770075444594332 -> (known after apply)
        id                  = "calitp-staging-composer-dags/download_parse_and_validate_gtfs.py"
!~      md5hash             = "kwmnFy/FxUr7dnmDCPosRA==" -> (known after apply)
        name                = "dags/download_parse_and_validate_gtfs.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_unzip_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "VGfPhg==" -> (known after apply)
!~      detect_md5hash      = "2ZK79GTQ8yecavoJT5etRA==" -> "different hash"
!~      generation          = 1770075444703315 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_unzip_hook.py"
!~      md5hash             = "2ZK79GTQ8yecavoJT5etRA==" -> (known after apply)
        name                = "plugins/hooks/gtfs_unzip_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/hooks/gtfs_validator_hook.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FX2mrw==" -> (known after apply)
!~      detect_md5hash      = "W9kUYai6r7vIvglNB7RbRQ==" -> "different hash"
!~      generation          = 1770075444691598 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/hooks/gtfs_validator_hook.py"
!~      md5hash             = "W9kUYai6r7vIvglNB7RbRQ==" -> (known after apply)
        name                = "plugins/hooks/gtfs_validator_hook.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/bigquery_to_download_config_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "MBwK0w==" -> (known after apply)
!~      detect_md5hash      = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> "different hash"
!~      generation          = 1770075444597508 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/bigquery_to_download_config_operator.py"
!~      md5hash             = "B0tjZ6Mk+FcRPHbxEm9Ryw==" -> (known after apply)
        name                = "plugins/operators/bigquery_to_download_config_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/download_config_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "9fno4A==" -> (known after apply)
!~      detect_md5hash      = "N4XY9eVgVQzOJVHhLIMmVg==" -> "different hash"
!~      generation          = 1770075444690072 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/download_config_to_gcs_operator.py"
!~      md5hash             = "N4XY9eVgVQzOJVHhLIMmVg==" -> (known after apply)
        name                = "plugins/operators/download_config_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gtfs_csv_to_jsonl_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "Fb30Vg==" -> (known after apply)
!~      detect_md5hash      = "Gv1WkUpcJDSAE2xIrwJBPA==" -> "different hash"
!~      generation          = 1770146824123009 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gtfs_csv_to_jsonl_operator.py"
!~      md5hash             = "Gv1WkUpcJDSAE2xIrwJBPA==" -> (known after apply)
        name                = "plugins/operators/gtfs_csv_to_jsonl_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/unzip_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "FDzk3g==" -> (known after apply)
!~      detect_md5hash      = "cJftSH+yHJ5jGmOH375thQ==" -> "different hash"
!~      generation          = 1770075444598576 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/unzip_gtfs_to_gcs_operator.py"
!~      md5hash             = "cJftSH+yHJ5jGmOH375thQ==" -> (known after apply)
        name                = "plugins/operators/unzip_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/validate_gtfs_to_gcs_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "kX9glw==" -> (known after apply)
!~      detect_md5hash      = "TCQBdT8Ew3qt3H/fmJDIbw==" -> "different hash"
!~      generation          = 1770075444617026 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/validate_gtfs_to_gcs_operator.py"
!~      md5hash             = "TCQBdT8Ew3qt3H/fmJDIbw==" -> (known after apply)
        name                = "plugins/operators/validate_gtfs_to_gcs_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "3vurAQ==" -> (known after apply)
!~      detect_md5hash      = "4HXvzw0SStxXHWiOoa1U+w==" -> "different hash"
!~      generation          = 1770152026203233 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "4HXvzw0SStxXHWiOoa1U+w==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_rt_service_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "+xxgdw==" -> (known after apply)
!~      detect_md5hash      = "USh7xVmTEZFW/qb5pAGWrw==" -> "different hash"
!~      generation          = 1768952765869620 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_rt_service_summary.sql"
!~      md5hash             = "USh7xVmTEZFW/qb5pAGWrw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_rt_service_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "kznlrA==" -> (known after apply)
!~      detect_md5hash      = "4/spx75Uef+ioBdk/DxI6w==" -> "different hash"
!~      generation          = 1768952765875364 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
!~      md5hash             = "4/spx75Uef+ioBdk/DxI6w==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_operator_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs/fct_daily_schedule_rt_route_direction_summary.sql"] will be created
+   resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
+       bucket         = "calitp-staging-composer"
+       content        = (sensitive value)
+       content_type   = (known after apply)
+       crc32c         = (known after apply)
+       detect_md5hash = "different hash"
+       generation     = (known after apply)
+       id             = (known after apply)
+       kms_key_name   = (known after apply)
+       md5hash        = (known after apply)
+       md5hexhash     = (known after apply)
+       media_link     = (known after apply)
+       name           = "data/warehouse/models/mart/gtfs/fct_daily_schedule_rt_route_direction_summary.sql"
+       output_name    = (known after apply)
+       self_link      = (known after apply)
+       source         = "../../../../warehouse/models/mart/gtfs/fct_daily_schedule_rt_route_direction_summary.sql"
+       storage_class  = (known after apply)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "3w2erQ==" -> (known after apply)
!~      detect_md5hash      = "w39Xm0OqISk3vmji3qvwAw==" -> "different hash"
!~      generation          = 1768952765872798 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"
!~      md5hash             = "w39Xm0OqISk3vmji3qvwAw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_rollup/fct_monthly_operator_summary.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-dags["models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-dags" {
!~      crc32c              = "BhO3KA==" -> (known after apply)
!~      detect_md5hash      = "cz1QboIvvtrcofpG6RtCIw==" -> "different hash"
!~      generation          = 1768952765878615 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"
!~      md5hash             = "cz1QboIvvtrcofpG6RtCIw==" -> (known after apply)
        name                = "data/warehouse/models/mart/transit_database/bridge_gtfs_analysis_name_x_ntd.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "QgCzjw==" -> (known after apply)
!~      detect_md5hash      = "hBVp8iTKUGiQy4+wmRDHAw==" -> "different hash"
!~      generation          = 1770152027650648 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "hBVp8iTKUGiQy4+wmRDHAw==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 1 to add, 15 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #1427](https://github.com/cal-itp/data-infra/actions/runs/21730591150)